SOAP Web Service using Apache CXF/if u wanna test SOAP service

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:ser="http://example.com/">

 <soapenv:Header/>

 <soapenv:Body>
  <ser:add>
   <num1>10</num1>
   <num2>5</num2>
  </ser:add>
 </soapenv:Body>

</soapenv:Envelope>